Revit 2024 API
ElectricalSystem.Rating Property
 The Rating value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double Rating { get; set; }
Visual Basic
Public Property Rating As Double
	Get
	Set
Visual C++
public:
property double Rating {
	double get ();
	void set (double value);
}
Remarks
 This property is used to retrieve the Rating value of the Electrical System.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The given value for rating is not a number -or- When setting this property: The given value for rating is not finite
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for rating must be non-negative.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  This property only available when System Type is Power!
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace